Documents/СменноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СменноеЗадание</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСменныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОперацииКСозданиюСменныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОперацииКСозданиюСменныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВремяВыполнения</Name>
					<Comment>Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МожноНазначать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НужноНазначать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НарушенПорядокНазначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СменноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Comment>Уникальный идентификатор операции в маршрутной карте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыСменныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыСменныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПроизводственныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПроизводственныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РабочиеЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>РабочиеЦентры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентВремениРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасценкаРабота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасценкаПереналадка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Бригады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Бригады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПрименятьРаспределениеПоКТУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СменноеЗадание/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Конструктор структуры, которая используется для заполнения новых документов.
// 
// Возвращаемое значение:
//  Структура - структура с ключами:
//		* Дата - Дата -
//		* Подразделение - СправочникСсылка.СтруктураПредприятия -
//		* Смена - СправочникСсылка.Календари -
//		* ЗаполнитьИсполнителейИзПрошлойСмены - Булево -
//
Функция ДанныеЗаполнения() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Дата");
	Результат.Вставить("Подразделение");
	Результат.Вставить("Смена");
	Результат.Вставить("Участок");
	Результат.Вставить("ЗаполнитьИсполнителейИзПрошлойСмены", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Создает и заполняет новые документы.
//
// Параметры:
//  МассивДанныхЗаполнения - Массив - массив с данными заполнения (см. ДанныеЗаполнения).
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.СменноеЗадание - ссылки на созданные документы.
//
Функция СоздатьЗадания(МассивДанныхЗаполнения) Экспорт
	
	Ссылки = Новый Массив;
		
	НачатьТранзакцию();
	
	Попытка
		
		Для каждого ДанныеЗаполнения Из МассивДанныхЗаполнения Цикл
			
			Объект = Документы.СменноеЗадание.СоздатьДокумент();
			
			Объект.Заполнить(ДанныеЗаполнения);
			
			Объект.Записать(РежимЗаписиДокумента.Проведение);
			
			Ссылки.Добавить(Объект.Ссылка);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Сменные задания';uk='Змінні завдання'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.СменноеЗадание,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение НСтр("ru='Не удалось создать сменные задания';uk='Не вдалося створити змінні завдання'");
		
	КонецПопытки;
	
	Возврат Ссылки;
	
КонецФункции

// Добавляет нового исполнителя в документ.
//
// Параметры:
//  Ссылка		 - ДокументСсылка.СменноеЗадание - ссылка на документ.
//  Исполнители	 - Массив - значения с типом СправочникСсылка.Бригады, СправочникСсылка.ФизическиеЛица.
//
Процедура ДобавитьИсполнителей(Ссылка, Исполнители) Экспорт
	
	Попытка
		
		Объект = Ссылка.ПолучитьОбъект();
		Объект.Заблокировать();
		
		Для каждого Исполнитель Из Исполнители Цикл
			Объект.Исполнители.Добавить().Исполнитель = Исполнитель;
		КонецЦикла;
		
		Объект.Записать(РежимЗаписиДокумента.Запись);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Сменные задания';uk='Змінні завдання'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Ссылка.Метаданные(),
			Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение СтрШаблон(НСтр("ru='Не удалось добавить исполнителей в документ %1';uk='Не вдалося додати виконавців в документ %1'"), Ссылка);
		
	КонецПопытки;
	
КонецПроцедуры

// Удаляет исполнителя из документа.
//
// Параметры:
//  Ссылка		 - ДокументСсылка.СменноеЗадание - ссылка на документ.
//  Исполнитель	 - СправочникСсылка.Бригады, СправочникСсылка.ФизическиеЛица - исполнитель.
//
Процедура УдалитьИсполнителя(Ссылка, Исполнитель) Экспорт
	
	Попытка
		
		Объект = Ссылка.ПолучитьОбъект();
		Объект.Заблокировать();
		
		Строка = Объект.Исполнители.Найти(Исполнитель, "Исполнитель");
		
		Если Строка <> Неопределено Тогда
			
			Объект.Исполнители.Удалить(Строка);
			Объект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Сменные задания';uk='Змінні завдання'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Ссылка.Метаданные(),
			Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение СтрШаблон(НСтр("ru='Не удалось удалить исполнителя из документа %1';uk='Не вдалося вилучити виконавця з документа %1'"), Ссылка);
		
	КонецПопытки;
	
КонецПроцедуры

// Устанавливает статус документу
//
// Параметры:
//		Ссылка - ДокументСсылка.СменноеЗадание - ссылка на документ
//		Статус - ПеречислениеСсылка.СтатусыСменныхЗаданий - статус
//
Процедура УстановитьСтатус(Ссылка, Статус) Экспорт
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Документ.СменноеЗадание.УстановитьСтатус");
	
	УстановитьСтатусВнутриЗамераВремени(Ссылка, Статус);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, КоличествоОпераций(Ссылка, Статус));
	
КонецПроцедуры

#Область Команды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Команда = Документы.ВыработкаСотрудников.ДобавитьКомандуСоздатьНаОснованииСозданиеВыработкиСотрудников(КомандыСозданияНаОсновании);
	
	Если Параметры.ИмяФормы = "Документ.СменноеЗадание.Форма.ФормаДокумента" 
		Или Параметры.ИмяФормы = "Обработка.ФормированиеСменныхЗаданий.РабочееМесто" Тогда

			Команда.ТипПараметра = Новый ОписаниеТипов ("ДокументСсылка.СменноеЗадание, ДокументСсылка.ПроизводственнаяОперация2_2");
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Сменное задание
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СменноеЗадание";
	КомандаПечати.Представление = НСтр("ru='Сменное задание';uk='Змінне завдання'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 1;
	
	// Сменное задание по исполнителям
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СменноеЗаданиеПоИсполнителям";
	КомандаПечати.Представление = НСтр("ru='Сменное задание (по исполнителям)';uk='Змінне завдання (по виконавцях)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 2;
	
	// Сменное задание по рабочим центрам
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СменноеЗаданиеПоРабочимЦентрам";
	КомандаПечати.Представление = НСтр("ru='Сменное задание (по рабочим центрам)';uk='Змінне завдання (по робочих центрах)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 3;
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// Входящие:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// Исходящие:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СменноеЗадание") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СменноеЗадание",
			НСтр("ru='Сменное задание';uk='Змінне завдання'"), 
			СформироватьПечатнуюФормуСменноеЗадание(МассивОбъектов, ОбъектыПечати, ПараметрыПечати,, ПараметрыВывода),,,,Истина);// ЭтоМногоязычнаяПечатнаяФорма
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СменноеЗаданиеПоИсполнителям") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СменноеЗаданиеПоИсполнителям",
			НСтр("ru='Сменное задание (по исполнителям)';uk='Змінне завдання (по виконавцях)'"),   
			СформироватьПечатнуюФормуСменноеЗадание(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, "Исполнитель", ПараметрыВывода),,,,Истина);  // ЭтоМногоязычнаяПечатнаяФорма
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СменноеЗаданиеПоРабочимЦентрам") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СменноеЗаданиеПоРабочимЦентрам",
			НСтр("ru='Сменное задание (по рабочим центрам)';uk='Змінне завдання (по робочих центрах)'"), 
			СформироватьПечатнуюФормуСменноеЗадание(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, "РабочийЦентр", ПараметрыВывода),,,,Истина);  // ЭтоМногоязычнаяПечатнаяФорма
		
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(
		ПараметрыВывода.ПараметрыОтправки,
		МассивОбъектов,
		КоллекцияПечатныхФорм);	
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуСменноеЗадание(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ВариантГруппировки="", ПараметрыВывода)

	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СменноеЗадание"+ВариантГруппировки;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СменноеЗадание.ПФ_MXL_СменноеЗадание", КодЯзыкаПечать);
	
	Таблица = СменноеЗаданиеДанныеПечатнойФормы(МассивОбъектов, ВариантГруппировки);
	НомерСтроки = 0;
	ИмяОбластиПостфикс = "";
	ВариантГруппировкиОбратный = ?(ПустаяСтрока(ВариантГруппировки),
		"",
		?(ВариантГруппировки = "Исполнитель", "РабочийЦентр", "Исполнитель"));
	
	Для Индекс = 0 По Таблица.Количество()-1 Цикл
		
		Строка = Таблица[Индекс];
		
		Если Индекс = 0
			ИЛИ Строка.Ссылка <> Таблица[Индекс-1].Ссылка
			ИЛИ НЕ ПустаяСтрока(ВариантГруппировки) И Строка[ВариантГруппировки] <> Таблица[Индекс-1][ВариантГруппировки] Тогда
			
			Если Индекс <> 0 Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			НомерСтроки = 0;
			
			ИмяОбластиПостфикс = "";
			Если НЕ ПустаяСтрока(ВариантГруппировки) Тогда
				ИмяОбластиПостфикс = ИмяОбластиПостфикс + "Группировка";
			КонецЕсли;
			Если Строка.Статус = Перечисления.СтатусыСменныхЗаданий.Формируется Тогда
				ИмяОбластиПостфикс = ИмяОбластиПостфикс + "Формируется";
			КонецЕсли;
			
			// Заголовок
			Область = Макет.ПолучитьОбласть("Заголовок");
	    	Область.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Строка.Номер, Ложь, Истина);
			Область.Параметры.Дата	= Формат(Строка.Дата, "ДЛФ=D");
			
			ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
				ТабличныйДокумент, Макет, Область, Строка.Ссылка);
			
			ТабличныйДокумент.Вывести(Область);
			
	    	// Шапка
			Если ПустаяСтрока(ВариантГруппировки) Тогда
				Область = Макет.ПолучитьОбласть("Шапка");
			Иначе
				Область = Макет.ПолучитьОбласть("ШапкаСГруппировкой");
				Область.Параметры.Группировка = ?(ВариантГруппировки = "Исполнитель",    
					НСтр("ru='Исполнитель:';uk='Виконавець:'",КодЯзыкаПечать),
					НСтр("ru='Рабочий центр:';uk='Робочий центр:'",КодЯзыкаПечать));
				Область.Параметры.ЗначениеГруппировки = Строка[ВариантГруппировки];
				Область.Параметры.ЗначениеГруппировкиПредставление = Строка[ВариантГруппировки + "Представление"];
			КонецЕсли;
			
			Область.Параметры.Заполнить(Строка);
	    	ТабличныйДокумент.Вывести(Область);
	
			// Шапка таблицы
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы" + ИмяОбластиПостфикс);
			Если НЕ ПустаяСтрока(ВариантГруппировки) Тогда
				Область.Параметры.Группировка = ?(ВариантГруппировки = "Исполнитель",    
					НСтр("ru='Рабочий центр:';uk='Робочий центр:'",КодЯзыкаПечать),
					НСтр("ru='Исполнитель:';uk='Виконавець:'",КодЯзыкаПечать));
			КонецЕсли;
		
			ТабличныйДокумент.Вывести(Область);
			
		КонецЕсли;
		
		// Строка
		Если Строка.ЕстьОперация Тогда
			
			НомерСтроки = НомерСтроки + 1;
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы" + ИмяОбластиПостфикс);
			
			Область.Параметры.Заполнить(Строка);
			Область.Параметры.НомерСтроки = НомерСтроки;
			Если ЗначениеЗаполнено(ВариантГруппировки) Тогда
				Область.Параметры.ЗначениеГруппировки = Строка[ВариантГруппировкиОбратный];
				Область.Параметры.ЗначениеГруппировкиПредставление = Строка[ВариантГруппировкиОбратный + "Представление"];
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(Область);
			
		КонецЕсли;
		
		// Подвал
		Если Индекс = Таблица.Количество()-1
			ИЛИ Строка.Ссылка <> Таблица[Индекс+1].Ссылка
			ИЛИ НЕ ПустаяСтрока(ВариантГруппировки) И Строка[ВариантГруппировки] <> Таблица[Индекс+1][ВариантГруппировки] Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПодвалТаблицы"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
		
	Возврат ТабличныйДокумент;
		
КонецФункции

// Параметры:
// 	МассивОбъектов
// 	ВариантГруппировки - Строка - Описание
// Возвращаемое значение:
// 	ТаблицаЗначений - где:
// * Ссылка - ДокументСсылка.СменноеЗадание - 
Функция СменноеЗаданиеДанныеПечатнойФормы(МассивОбъектов, ВариантГруппировки)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Задание.Ссылка                      КАК Ссылка,
		|	Задание.Номер                       КАК Номер,
		|	Задание.Дата                        КАК Дата,
		|	Задание.Статус                      КАК Статус,
		|	Задание.Подразделение               КАК Подразделение,
		|	Задание.Подразделение.Представление КАК ПодразделениеПредставление,
		|	Задание.Смена                       КАК Смена,
		|	Задание.Смена.Представление         КАК СменаПредставление,
		|
		|	ЕСТЬNULL(Операции.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)) КАК РабочийЦентр,
		|	ЕСТЬNULL(Операции.РабочийЦентр.Представление, """")                              КАК РабочийЦентрПредставление,
		|
		|	ВЫБОР
		|		КОГДА Операции.Исполнитель ЕСТЬ NULL
		|			ИЛИ Операции.Исполнитель В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ Операции.Исполнитель
		|	КОНЕЦ                            КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА Операции.Исполнитель ЕСТЬ NULL
		|			ИЛИ Операции.Исполнитель В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка))
		|			ТОГДА """"
		|		ИНАЧЕ Операции.Исполнитель.Представление
		|	КОНЕЦ                            КАК ИсполнительПредставление,
		|
		|	НЕ Операции.Ссылка ЕСТЬ NULL     КАК ЕстьОперация,
		|
		|	Операции.Операция                КАК Операция,
		|	Операции.Наименование            КАК ОперацияПредставление,
		|	Операции.ВремяВыполнения         КАК Время,
		|	Операции.ВремяВыполненияЕдИзм    КАК ВремяЕдиницаИзмерения,
		|	Операции.Количество              КАК КоличествоПлан,
		|	Операции.КоличествоФакт          КАК КоличествоФакт,
		|	Операции.Ссылка                  КАК ПроизводственнаяОперацияСсылка,
		|	Операции.Номер                   КАК ПроизводственнаяОперацияНомер
		|ИЗ
		|	Документ.СменноеЗадание КАК Задание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводственнаяОперация2_2 КАК Операции
		|		ПО Задание.Ссылка = Операции.СменноеЗадание
		|ГДЕ
		|	Задание.Ссылка В(&МассивОбъектов)
		|	И Задание.Статус <> &СтатусФормируется
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Задание.Ссылка,
		|	Задание.Номер,
		|	Задание.Дата,
		|	Задание.Статус,
		|	Задание.Подразделение,
		|	Задание.Подразделение.Представление,
		|	Задание.Смена,
		|	Задание.Смена.Представление,
		|
		|	ЕСТЬNULL(Операции.РабочийЦентр, ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)),
		|	ЕСТЬNULL(Операции.РабочийЦентр.Представление, """"),
		|
		|	ВЫБОР
		|		КОГДА Операции.Исполнитель ЕСТЬ NULL
		|			ИЛИ Операции.Исполнитель В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка))
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|		ИНАЧЕ Операции.Исполнитель
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Операции.Исполнитель ЕСТЬ NULL
		|			ИЛИ Операции.Исполнитель В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.Бригады.ПустаяСсылка))
		|			ТОГДА """"
		|		ИНАЧЕ Операции.Исполнитель.Представление
		|	КОНЕЦ,
		|
		|	НЕ Операции.Операция ЕСТЬ NULL,
		|
		|	Операции.Операция,
		|	Операции.Операция.Представление,
		|	&ОперацииВремяВыполнения,
		|	Операции.ВремяЕдИзм,
		|	Операции.Количество,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Документ.СменноеЗадание КАК Задание
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
		|		ПО Задание.Ссылка = Операции.СменноеЗадание
		|ГДЕ
		|	Задание.Ссылка В(&МассивОбъектов)
		|	И Задание.Статус = &СтатусФормируется";
	
	Если ПустаяСтрока(ВариантГруппировки) Тогда
		ТекстЗапроса = ТекстЗапроса + " УПОРЯДОЧИТЬ ПО Ссылка, Операция АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		ТекстЗапроса = ТекстЗапроса + " УПОРЯДОЧИТЬ ПО Ссылка, " + ВариантГруппировки + ", Операция АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ОперацииВремяВыполнения",
		РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.ТекстЗапросаВремяОперации("Операции"));
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("СтатусФормируется", Перечисления.СтатусыСменныхЗаданий.Формируется);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область Прочее

// Параметры:
// 	Параметры - Структура - 
// 	АдресХранилища - УникальныйИдентификатор - 
Процедура УстановитьСтатусВФоне(Параметры, АдресХранилища) Экспорт
	
	Попытка
		
		УстановитьСтатус(Параметры.Ссылка, Параметры.Статус);
		
	Исключение
		
		ПоместитьВоВременноеХранилище(
			Новый Структура("Сообщения", ПолучитьСообщенияПользователю()),
			АдресХранилища);
		
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьСтатусВнутриЗамераВремени(Ссылка, Статус)
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("Документ.СменноеЗадание");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("Документ.ПроизводственнаяОперация2_2");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("СменноеЗадание", Ссылка);
		
		БлокировкаДанных.Заблокировать();
		
		// Установка статуса
		Объект = Ссылка.ПолучитьОбъект();
		Объект.Заблокировать();
		Объект.Статус = Статус;
		Объект.Записать();
		
		// Изменение регистра и производственных операций
		Если Статус = Перечисления.СтатусыСменныхЗаданий.Формируется Тогда
			
			РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.ДокументыВРегистр(
				Ссылка);
			
		ИначеЕсли Статус = Перечисления.СтатусыСменныхЗаданий.Сформировано Тогда
			
			РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.РегистрВДокументы(
				Ссылка,
				Перечисления.СтатусыПроизводственныхОпераций.Создана);
			
		ИначеЕсли Статус = Перечисления.СтатусыСменныхЗаданий.Закрыто Тогда
			
			РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.РегистрВДокументы(
				Ссылка,
				Перечисления.СтатусыПроизводственныхОпераций.Выполнена);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru='Сменные задания';uk='Змінні завдання'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Ссылка.Метаданные(),
			Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение СтрШаблон(НСтр("ru='Не удалось установить статус %1 документу %2';uk='Не вдалося встановити статус %1 документу %2'"), Статус, Ссылка);
		
	КонецПопытки;
	
КонецПроцедуры

Функция КоличествоОпераций(Ссылка, Статус)
	
	Запрос = Новый Запрос;
	
	Если Статус = Перечисления.СтатусыСменныхЗаданий.Формируется Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СУММА(1) КАК КоличествоОпераций
			|ИЗ
			|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Операции
			|ГДЕ
			|	Операции.СменноеЗадание = &Ссылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(1) ЕСТЬ НЕ NULL";
		
	Иначе
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СУММА(1) КАК КоличествоОпераций
			|ИЗ
			|	Документ.ПроизводственнаяОперация2_2 КАК Операции
			|ГДЕ
			|	Операции.СменноеЗадание = &Ссылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(1) ЕСТЬ НЕ NULL";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.КоличествоОпераций;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
